{
  "books": [
     {
      "id": 1,
      "author": "Bryan Stevenson",
      "title": "Just Mercy",
      "description": "Just Mercy is at once an unforgettable account of an idealistic, gifted young lawyer’s coming of age, a moving window into the lives of those he has defended, and an inspiring argument for compassion in the pursuit of true justice.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/91eRIvymqRL.jpg",
      "published": 2014
    },
    {
      "id": 2,
      "author": "N. K. Jemisin",
      "title": "The Fifth Season",
      "description": "This is the way the world ends. Again. Three terrible things happen in a single day. Essun, a woman living an ordinary life in a small town, comes home to find that her husband has brutally murdered their son and kidnapped their daughter. At the end of the world, a woman must hide her secret power and find her kidnapped daughter in this intricate and extraordinary novel of power, oppression, and revolution.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/61XfS2XCw3L.jpg",
      "published": 2015
    },
    {
      "id": 3,
      "author": "Ijeoma Oluo",
      "title": "So You Want to Talk About Race",
      "description": "In So You Want to Talk About Race, Ijeoma Oluo guides readers of all races through subjects ranging from intersectionality and affirmative action to 'model minorities' in an attempt to make the seemingly impossible possible: honest conversations about race and racism, and how they infect almost every aspect of American life.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/51XLHiMQA5L.jpg",
      "published": 2018
    },
    {
      "id": 4,
      "author": "James Baldwin",
      "title": "If Beale Street Could Talk",
      "description": "Told through the eyes of Tish, a nineteen-year-old girl, in love with Fonny, a young sculptor who is the father of her child, Baldwin’s story mixes the sweet and the sad. Tish and Fonny have pledged to get married, but Fonny is falsely accused of a terrible crime and imprisoned. Their families set out to clear his name, and as they face an uncertain future, the young lovers experience a kaleidoscope of emotions–affection, despair, and hope.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/917d8ic+NyL.jpg",
      "published": 1974
    },
    {
      "id": 5,
      "author": "Angela Y. Davis",
      "title": "Are Prisons Obsolete?",
      "description": "With her characteristic brilliance, grace and radical audacity, Angela Y. Davis has put the case for the latest abolition movement in American life: the abolition of the prison. As she quite correctly notes, American life is replete with abolition movements, and when they were engaged in these struggles, their chances of success seemed almost unthinkable. For generations of Americans, the abolition of slavery was sheerest illusion. Davis expertly argues how social movements transformed these social, political and cultural institutions, and made such practices untenable.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/71Sb-LtswpL.jpg",
      "published": 2003
    },
    {
      "id": 6,
      "author": "Octavia E. Butler",
      "title": "Parable of the Sower",
      "description": "When global climate change and economic crises lead to social chaos in the early 2020s, California becomes full of dangers, from pervasive water shortage to masses of vagabonds who will do anything to live to see another day. Fifteen-year-old Lauren Olamina lives inside a gated community with her preacher father, family, and neighbors, sheltered from the surrounding anarchy. In a society where any vulnerability is a risk, she suffers from hyperempathy, a debilitating sensitivity to others' emotions. Precocious and clear-eyed, Lauren must make her voice heard in order to protect her loved ones from the imminent disasters her small community stubbornly ignores.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/81WXGS76dzL.jpg",
      "published": 1993
    },
    {
      "id": 7,
      "author": "Ta-Nehisi Coates",
      "title": "The Water Dancer",
      "description": "Young Hiram Walker was born into bondage. When his mother was sold away, Hiram was robbed of all memory of her—but was gifted with a mysterious power. Years later, when Hiram almost drowns in a river, that same power saves his life. This brush with death births an urgency in Hiram and a daring scheme: to escape from the only home he’s ever known.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/91mho0umzyL.jpg",
      "published": 2019
    },
    {
      "id": 8,
      "author": "Malcolm X and Alex Haley",
      "title": "The Autobiography of Malcolm X",
      "description": "In the searing pages of this classic autobiography, originally published in 1964, Malcolm X, the Muslim leader, firebrand, and anti-integrationist, tells the extraordinary story of his life and the growth of the Black Muslim movement. His fascinating perspective on the lies and limitations of the American Dream, and the inherent racism in a society that denies its nonwhite citizens the opportunity to dream, gives extraordinary insight into the most urgent issues of our own time.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/81kQBRCqt-L.jpg",
      "published": 1965
    },
    {
      "id": 9,
      "author": "Saeed Jones",
      "title": "How We Fight for Our Lives",
      "description": "Haunted and haunting, How We Fight for Our Lives is a stunning coming-of-age memoir about a young, black, gay man from the South as he fights to carve out a place for himself, within his family, within his country, within his own hopes, desires, and fears. Through a series of vignettes that chart a course across the American landscape, Jones draws readers into his boyhood and adolescence—into tumultuous relationships with his family, into passing flings with lovers, friends, and strangers.",
      "image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1564946002l/43682552.jpg",
      "published": 2019
    },
    {
      "id": 10,
      "author": "Glory Edim",
      "title": "Well-Read Black Girl: Finding Our Stories, Discovering Ourselves",
      "description": "Remember that moment when you first encountered a character who seemed to be written just for you? That feeling of belonging remains with readers the rest of their lives—but not everyone regularly sees themselves in the pages of a book. In this timely anthology, Glory Edim brings together original essays by some of our best black women writers to shine a light on how important it is that we all—regardless of gender, race, religion, or ability—have the opportunity to find ourselves in literature.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/81ZNOPFiZ3L.jpg",
      "published": 2018
    },
    {
      "id": 11,
      "author": "Maya Angelou",
      "title": "I Know Why the Caged Bird Sings",
      "description": "Here is a book as joyous and painful, as mysterious and memorable, as childhood itself. I Know Why the Caged Bird Sings captures the longing of lonely children, the brute insult of bigotry, and the wonder of words that can make the world right. Maya Angelou’s debut memoir is a modern American classic beloved worldwide.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/71IrTqSVOjL.jpg",
      "published": 1969
    },
    {
      "id": 12,
      "author": "Helen Oyeyemi",
      "title": "Gingerbread",
      "description": "Influenced by the mysterious place gingerbread holds in classic children's stories, beloved novelist Helen Oyeyemi invites readers into a delightful tale of a surprising family legacy, in which the inheritance is a recipe.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/81p38FdoFuL.jpg",
      "published": 2019
    },
    {
      "id": 13,
      "author": "Audre Lorde",
      "title": "Sister Outsider: Essays and Speeches",
      "description": "In this charged collection of fifteen essays and speeches, Lorde takes on sexism, racism, ageism, homophobia, and class, and propounds social difference as a vehicle for action and change. Her prose is incisive, unflinching, and lyrical, reflecting struggle but ultimately offering messages of hope.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/81TCU-ew0jL.jpg",
      "published": 1984
    },
    {
      "id": 14,
      "author": "Nnedi Okorafor",
      "title": "Who Fears Death",
      "description": "In a post-apocalyptic Africa, the world has changed in many ways; yet in one region genocide between tribes still bloodies the land. A woman who has survived the annihilation of her village and a terrible rape by an enemy general wanders into the desert, hoping to die. Instead, she gives birth to an angry baby girl with hair and skin the color of sand. Gripped by the certainty that her daughter is different—special—she names her Onyesonwu, which means \"Who fears death?\"  in an ancient language.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/81SkRS2Mi3L.jpg",
      "published": 2010
    },
    {
      "id": 15,
      "author": "Ann Petry",
      "title": "Who Fears Death",
      "description": "The Street tells the poignant, often heartbreaking story of Lutie Johnson, a young black woman, and her spirited struggle to raise her son amid the violence, poverty, and racial dissonance of Harlem in the late 1940s. Originally published in 1946 and hailed by critics as a masterwork, The Street was Ann Petry's first novel, a beloved bestseller with more than a million copies in print. Its haunting tale still resonates today.",
      "image": "https://www.hmhbooks.com/shop/books/assets/product/9780358187547_lres.gif",
      "published": 1946
    },
    {
      "id": 16,
      "author": "Octavia Butler",
      "title": "Kindred",
      "description": "Dana, a modern black woman, is celebrating her twenty-sixth birthday with her new husband when she is snatched abruptly from her home in California and transported to the antebellum South. Rufus, the white son of a plantation owner, is drowning, and Dana has been summoned to save him. Dana is drawn back repeatedly through time to the slave quarters, and each time the stay grows longer, more arduous, and more dangerous until it is uncertain whether or not Dana's life will end, long before it has a chance to begin.",
      "image": "https://images-na.ssl-images-amazon.com/images/I/81KU7ZGvnZL.jpg",
      "published": 1979
    }
  ]
}
